Day-8/flowOverASphere/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-8 1e-8 1e-8);

boundaryField
{
    top
    {
	type		noSlip;
    }

    bottom
    {
	type		noSlip;
    }

    left
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    right
    {
        //type            zeroGradient;
	//type		pressureInletOutletVelocity;
	//value		uniform (0.1 0 0);
	type		outletInlet;
	outletValue	uniform (1 0 0);
    }

    front
    {
	type		noSlip;
    }

    back
    {
	type		noSlip;
    }

    sphere
    {
	type		noSlip;
    }
}


// ************************************************************************* //
